degenegge-code/am263/example.syscfg
epwm3.$name                                    = "CONFIG_EPWM2";
epwm3.epwmTimebase_periodGld                   = true;
epwm3.epwmCounterCompare_cmpAGld               = true;
epwm3.epwmCounterCompare_cmpBGld               = true;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld = true;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld = true;
epwm3.EPWM.$assign                             = "EPWM2";
epwm3.EPWM.A.$assign                           = "EPWM2_A";
epwm3.EPWM.B.$assign                           = "EPWM2_B";

epwm4.$name                                = "CONFIG_EPWM3";
epwm4.epwmTimebase_periodGld               = true;
epwm4.epwmCounterCompare_cmpAGld           = true;
epwm4.epwmCounterCompare_cmpBGld           = true;
epwm4.epwmEventTrigger_enableInterrupt     = true;
epwm4.epwmEventTrigger_interruptEventCount = "1";
epwm4.epwmTimebase_syncOutPulseMode        = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm4.hrpwm_syncSource                     = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm4.EPWM.$assign                         = "EPWM3";
epwm4.EPWM.A.$assign                       = "EPWM3_A";
epwm4.EPWM.B.$assign                       = "EPWM3_B";

epwm5.$name                                           = "CONFIG_EPWM4";
epwm5.epwmEventTrigger_enableInterrupt                = true;
epwm5.epwmEventTrigger_interruptEventCountInitEnable  = true;
epwm5.epwmEventTrigger_interruptEventCountInitValue   = "1";
epwm5.epwmTimebase_periodGld                          = true;
epwm5.epwmCounterCompare_cmpAGld                      = true;
epwm5.epwmCounterCompare_cmpBGld                      = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld        = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld        = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode = true;
epwm5.epwmCounterCompare_cmpA                         = 50;
epwm5.epwmCounterCompare_cmpB                         = 50;
epwm5.epwmEventTrigger_interruptEventCount            = "1";
epwm5.epwmEventTrigger_interruptSource                = "EPWM_INT_TBCTR_PERIOD";
epwm5.epwmTimebase_counterMode                        = "EPWM_COUNTER_MODE_UP";
epwm5.epwmTimebase_period                             = 1000;
epwm5.epwmTimebase_counterValue                       = 300;
epwm5.EPWM.$assign                                    = "EPWM4";
epwm5.EPWM.A.$assign                                  = "EPWM4_A";
epwm5.EPWM.B.$assign                                  = "EPWM4_B";

epwm6.$name                                                      = "CONFIG_EPWM5";
epwm6.epwmTimebase_periodGld                                     = true;
epwm6.epwmTimebase_phaseEnable                                   = true;
epwm6.epwmTimebase_phaseShift                                    = 11;
epwm6.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_INPUTXBAR_OUT4";
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmCounterCompare_cmpAGld                                 = true;
epwm6.epwmCounterCompare_cmpBGld                                 = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                   = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmCounterCompare_cmpA                                    = 1;
epwm6.epwmTimebase_period                                        = 55;
epwm6.epwmCounterCompare_cmpB                                    = 2;
epwm6.EPWM.$assign                                               = "EPWM5";
epwm6.EPWM.A.$assign                                             = "EPWM5_A";
epwm6.EPWM.B.$assign                                             = "EPWM5_B";

epwm7.$name                                                      = "CONFIG_EPWM6";
epwm7.epwmTimebase_periodGld                                     = true;
epwm7.epwmTimebase_period                                        = 5555;
epwm7.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_phaseEnable                                   = true;
epwm7.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_INPUTXBAR_OUT4";
epwm7.epwmTimebase_phaseShift                                    = 1;
epwm7.epwmTimebase_counterValue                                  = 222;
epwm7.epwmCounterCompare_cmpAGld                                 = true;
epwm7.epwmCounterCompare_cmpBGld                                 = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                   = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm7.epwmCounterCompare_cmpB                                    = 1;
epwm7.epwmCounterCompare_cmpA                                    = 1;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm7.EPWM.$assign                                               = "EPWM6";
epwm7.EPWM.A.$assign                                             = "EPWM6_A";
epwm7.EPWM.B.$assign                                             = "EPWM6_B";

eqep1.$name                = "CONFIG_EQEP0";
eqep1.enableInterrupt      = true;
eqep1.emulationMode        = "EQEP_EMULATIONMODE_RUNFREE";
eqep1.eqepResolution       = "EQEP_CONFIG_1X_RESOLUTION";
eqep1.positionCounterMax   = 4294967295;
eqep1.latchPositionCounter = "EQEP_LATCH_UNIT_TIME_OUT";
eqep1.swPositionInit       = true;
eqep1.enableModule         = true;
eqep1.positionCounterMode  = "EQEP_POSITION_RESET_UNIT_TIME_OUT";
eqep1.enableUnitTimer      = true;
eqep1.interruptSources     = ["EQEP_INT_UNIT_TIME_OUT"];
eqep1.unitTimerPeriod      = 200000;
eqep1.captureConfig        = true;
eqep1.selectSourceA        = "EQEP_SOURCE_DEVICE_PIN";
eqep1.selectSourceB        = "EQEP_SOURCE_DEVICE_PIN";
eqep1.EQEP.$assign         = "EQEP0";
eqep1.EQEP.A.$assign       = "EQEP0_A";
eqep1.EQEP.B.$assign       = "EQEP0_B";

gpio1.$name          = "CONFIG_GPIO65";
gpio1.slewRate       = "high";
gpio1.GPIO_n.$assign = "EPWM11_A";

const soc_ctrl_adc    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_adc", {}, false);
const soc_ctrl_adc1   = soc_ctrl_adc.addInstance({}, false);
soc_ctrl_adc1.$name   = "soc_ctrl_adc0";
const soc_ctrl        = scripting.addModule("/drivers/soc_ctrl/soc_ctrl", {}, false);
soc_ctrl.soc_ctrl_adc = soc_ctrl_adc1;

const soc_ctrl_cmpss    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_cmpss", {}, false);
const soc_ctrl_cmpss1   = soc_ctrl_cmpss.addInstance({}, false);
soc_ctrl_cmpss1.$name   = "soc_ctrl_cmpss0";
soc_ctrl.soc_ctrl_cmpss = soc_ctrl_cmpss1;

const soc_ctrl_ecap    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_ecap", {}, false);
const soc_ctrl_ecap1   = soc_ctrl_ecap.addInstance({}, false);
soc_ctrl_ecap1.$name   = "soc_ctrl_ecap0";
soc_ctrl.soc_ctrl_ecap = soc_ctrl_ecap1;
ecap.ecapSocControls   = soc_ctrl_ecap1;

const soc_ctrl_epwm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_epwm", {}, false);
const soc_ctrl_epwm1   = soc_ctrl_epwm.addInstance({}, false);
soc_ctrl_epwm1.$name   = "soc_ctrl_epwm0";
epwm.epwmTbClkSync     = soc_ctrl_epwm1;
soc_ctrl.soc_ctrl_epwm = soc_ctrl_epwm1;

const soc_ctrl_sdfm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_sdfm", {}, false);
const soc_ctrl_sdfm1   = soc_ctrl_sdfm.addInstance({}, false);
soc_ctrl_sdfm1.$name   = "soc_ctrl_sdfm0";
soc_ctrl.soc_ctrl_sdfm = soc_ctrl_sdfm1;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

